In [1]:
!python --version

Python 3.5.6 :: Anaconda, Inc.

In [2]:
import findspark

In [3]:
findspark.init("C:/spark")

In [5]:
from pyspark.sql import SparkSession

from pyspark.sql.session import SparkSession
#spark = SparkSession.builder.getOrCreate()

from pyspark.sql import SparkSession
from pyspark.sql.types import ArrayType, StructField, StructType, StringType, IntegerType

In [26]:
from pyspark.sql.session import SparkSession

#spark = SparkSession.builder.getOrCreate()
spark = SparkSession.builder.appName('Basics').getOrCreate()

In [27]:
df = spark.read.json('people.json')

In [28]:
df.show()

df.printSchema()

+----+-------+------+
| age|   name|weight|
+----+-------+------+
|null|Michael|    80|
|  30|   Andy|    86|
|  19| Justin|    67|
|null|    jun|    99|
|  22|  Carls|    77|
|  31| Jordan|    83|
+----+-------+------+

root
 |-- age: long (nullable = true)
 |-- name: string (nullable = true)
 |-- weight: long (nullable = true)

In [29]:
df.columns

['age', 'name', 'weight']

In [30]:
df.describe().show()

+-------+-----------------+----+------------------+
|summary|              age|name|            weight|
+-------+-----------------+----+------------------+
|  count|                4|   6|                 6|
|   mean|             25.5|null|              82.0|
| stddev|5.916079783099616|null|10.583005244258361|
|    min|               19|Andy|                67|
|    max|               31| jun|                99|
+-------+-----------------+----+------------------+

In [31]:
from pyspark.sql.types import (ArrayType, StructField, StructType, StringType, IntegerType)

In [32]:
# Defining Integer, String,...

data_schema = [StructField('age',IntegerType(),True),
              StructField('name',StringType(),True)]

             # IntegerField('name',StringType(),True)]
    
data_schema

[StructField(age,IntegerType,true), StructField(name,StringType,true)]

In [33]:
final_struc = StructType(fields=data_schema)

final_struc

StructType(List(StructField(age,IntegerType,true),StructField(name,StringType,true)))

In [34]:
df = spark.read.json('people.json', schema=final_struc)
df

DataFrame[age: int, name: string]

In [35]:
df.printSchema()

root
 |-- age: integer (nullable = true)
 |-- name: string (nullable = true)

In [36]:
df.show()

+----+-------+
| age|   name|
+----+-------+
|null|Michael|
|  30|   Andy|
|  19| Justin|
|null|    jun|
|  22|  Carls|
|  31| Jordan|
+----+-------+

In [37]:
type(df['age'])

pyspark.sql.column.Column

In [40]:
type(df.select('age'))

pyspark.sql.dataframe.DataFrame

In [53]:
df.select('age').show()

+----+
| age|
+----+
|null|
|  30|
|  19|
|null|
|  22|
|  31|
+----+

In [46]:
df.head(5)

[Row(age=None, name='Michael'),
 Row(age=30, name='Andy'),
 Row(age=19, name='Justin'),
 Row(age=None, name='jun'),
 Row(age=22, name='Carls')]

In [49]:
df.head(5)[0]
#df.head(5)[1]

Row(age=None, name='Michael')

In [51]:
df.select(['age','name'])

DataFrame[age: int, name: string]

In [52]:
df.select(['age','name']).show()

+----+-------+
| age|   name|
+----+-------+
|null|Michael|
|  30|   Andy|
|  19| Justin|
|null|    jun|
|  22|  Carls|
|  31| Jordan|
+----+-------+

In [41]:
df.select('age').show()

+----+
| age|
+----+
|null|
|  30|
|  19|
|null|
|  22|
|  31|
+----+

In [55]:
df.withColumn('primary_age',df['age']*2).show()

+----+-------+-----------+
| age|   name|primary_age|
+----+-------+-----------+
|null|Michael|       null|
|  30|   Andy|         60|
|  19| Justin|         38|
|null|    jun|       null|
|  22|  Carls|         44|
|  31| Jordan|         62|
+----+-------+-----------+

In [54]:
df.withColumn('double_age',df['name']*2).show()

+----+-------+----------+
| age|   name|double_age|
+----+-------+----------+
|null|Michael|      null|
|  30|   Andy|      null|
|  19| Justin|      null|
|null|    jun|      null|
|  22|  Carls|      null|
|  31| Jordan|      null|
+----+-------+----------+

In [57]:
df.show()

+----+-------+
| age|   name|
+----+-------+
|null|Michael|
|  30|   Andy|
|  19| Justin|
|null|    jun|
|  22|  Carls|
|  31| Jordan|
+----+-------+

In [58]:
df.withColumnRenamed('age','my_new_age').show()

+----------+-------+
|my_new_age|   name|
+----------+-------+
|      null|Michael|
|        30|   Andy|
|        19| Justin|
|      null|    jun|
|        22|  Carls|
|        31| Jordan|
+----------+-------+

In [59]:
df.createOrReplaceTempView('people')

In [60]:
results = spark.sql("SELECT * FROM people")

In [61]:
results.show()

+----+-------+
| age|   name|
+----+-------+
|null|Michael|
|  30|   Andy|
|  19| Justin|
|null|    jun|
|  22|  Carls|
|  31| Jordan|
+----+-------+

In [62]:
new_results = spark.sql("SELECT * FROM people WHERE age=30")

new_results.show()

+---+----+
|age|name|
+---+----+
| 30|Andy|
+---+----+

In [63]:
#################################################################################
#################################################################################
#################################################################################

In [64]:
from pyspark.sql import SparkSession

In [66]:
spark = SparkSession.builder.appName('ops').getOrCreate()

In [67]:
df = spark.read.csv('appl_stock.csv', inferSchema=True, header=True)

In [70]:
df

DataFrame[Date: timestamp, Open: double, High: double, Low: double, Close: double, Volume: int, Adj Close: double]

In [69]:
df.printSchema()

root
 |-- Date: timestamp (nullable = true)
 |-- Open: double (nullable = true)
 |-- High: double (nullable = true)
 |-- Low: double (nullable = true)
 |-- Close: double (nullable = true)
 |-- Volume: integer (nullable = true)
 |-- Adj Close: double (nullable = true)

In [71]:
df.show()

+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|               Date|              Open|              High|               Low|             Close|   Volume|         Adj Close|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|2010-01-04 00:00:00|        213.429998|        214.499996|212.38000099999996|        214.009998|123432400|         27.727039|
|2010-01-05 00:00:00|        214.599998|        215.589994|        213.249994|        214.379993|150476200|27.774976000000002|
|2010-01-06 00:00:00|        214.379993|            215.23|        210.750004|        210.969995|138040000|27.333178000000004|
|2010-01-07 00:00:00|            211.75|        212.000006|        209.050005|            210.58|119282800|          27.28265|
|2010-01-08 00:00:00|        210.299994|        212.000006|209.06000500000002|211.98000499999998|111902700|         27.464034|
|2010-01-11 00:00:00|212.79999700000002|        213.000002|        208.450005|210.11000299999998|115557400|         27.221758|
|2010-01-12 00:00:00|209.18999499999998|209.76999500000002|        206.419998|        207.720001|148614900|          26.91211|
|2010-01-13 00:00:00|        207.870005|210.92999500000002|        204.099998|        210.650002|151473000|          27.29172|
|2010-01-14 00:00:00|210.11000299999998|210.45999700000002|        209.020004|            209.43|108223500|         27.133657|
|2010-01-15 00:00:00|210.92999500000002|211.59999700000003|        205.869999|            205.93|148516900|26.680197999999997|
|2010-01-19 00:00:00|        208.330002|215.18999900000003|        207.240004|        215.039995|182501900|27.860484999999997|
|2010-01-20 00:00:00|        214.910006|        215.549994|        209.500002|            211.73|153038200|         27.431644|
|2010-01-21 00:00:00|        212.079994|213.30999599999998|        207.210003|        208.069996|152038600|         26.957455|
|2010-01-22 00:00:00|206.78000600000001|        207.499996|            197.16|            197.75|220441900|         25.620401|
|2010-01-25 00:00:00|202.51000200000001|        204.699999|        200.190002|        203.070002|266424900|26.309658000000002|
|2010-01-26 00:00:00|205.95000100000001|        213.710005|        202.580004|        205.940001|466777500|         26.681494|
|2010-01-27 00:00:00|        206.849995|            210.58|        199.530001|        207.880005|430642100|26.932840000000002|
|2010-01-28 00:00:00|        204.930004|        205.500004|        198.699995|        199.289995|293375600|25.819922000000002|
|2010-01-29 00:00:00|        201.079996|        202.199995|        190.250002|        192.060003|311488100|         24.883208|
|2010-02-01 00:00:00|192.36999699999998|             196.0|191.29999899999999|        194.729998|187469100|         25.229131|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
only showing top 20 rows

In [73]:
df.toPandas()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2010-01-04,213.429998,214.499996,212.380001,214.009998,123432400,27.727039
1,2010-01-05,214.599998,215.589994,213.249994,214.379993,150476200,27.774976
2,2010-01-06,214.379993,215.230000,210.750004,210.969995,138040000,27.333178
3,2010-01-07,211.750000,212.000006,209.050005,210.580000,119282800,27.282650
4,2010-01-08,210.299994,212.000006,209.060005,211.980005,111902700,27.464034
...,...,...,...,...,...,...,...
1757,2016-12-23,115.589996,116.519997,115.589996,116.519997,14249500,116.016995
1758,2016-12-27,116.519997,117.800003,116.489998,117.260002,18296900,116.753806
1759,2016-12-28,117.519997,118.019997,116.199997,116.760002,20905900,116.255965
1760,2016-12-29,116.449997,117.110001,116.400002,116.730003,15039500,116.226096
1761,2016-12-30,116.650002,117.199997,115.430000,115.820000,30586300,115.320020

In [77]:
df.toPandas().head(3)

,Date,Open,High,Low,Close,Volume,Adj Close
0,2010-01-04,213.429998,214.499996,212.380001,214.009998,123432400,27.727039
1,2010-01-05,214.599998,215.589994,213.249994,214.379993,150476200,27.774976
2,2010-01-06,214.379993,215.230000,210.750004,210.969995,138040000,27.333178

In [78]:
df.head(3)[0]

Row(Date=datetime.datetime(2010, 1, 3, 23, 0), Open=213.429998, High=214.499996, Low=212.38000099999996, Close=214.009998, Volume=123432400, Adj Close=27.727039)

In [81]:
df.filter("Close < 500").show()

+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|               Date|              Open|              High|               Low|             Close|   Volume|         Adj Close|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|2010-01-04 00:00:00|        213.429998|        214.499996|212.38000099999996|        214.009998|123432400|         27.727039|
|2010-01-05 00:00:00|        214.599998|        215.589994|        213.249994|        214.379993|150476200|27.774976000000002|
|2010-01-06 00:00:00|        214.379993|            215.23|        210.750004|        210.969995|138040000|27.333178000000004|
|2010-01-07 00:00:00|            211.75|        212.000006|        209.050005|            210.58|119282800|          27.28265|
|2010-01-08 00:00:00|        210.299994|        212.000006|209.06000500000002|211.98000499999998|111902700|         27.464034|
|2010-01-11 00:00:00|212.79999700000002|        213.000002|        208.450005|210.11000299999998|115557400|         27.221758|
|2010-01-12 00:00:00|209.18999499999998|209.76999500000002|        206.419998|        207.720001|148614900|          26.91211|
|2010-01-13 00:00:00|        207.870005|210.92999500000002|        204.099998|        210.650002|151473000|          27.29172|
|2010-01-14 00:00:00|210.11000299999998|210.45999700000002|        209.020004|            209.43|108223500|         27.133657|
|2010-01-15 00:00:00|210.92999500000002|211.59999700000003|        205.869999|            205.93|148516900|26.680197999999997|
|2010-01-19 00:00:00|        208.330002|215.18999900000003|        207.240004|        215.039995|182501900|27.860484999999997|
|2010-01-20 00:00:00|        214.910006|        215.549994|        209.500002|            211.73|153038200|         27.431644|
|2010-01-21 00:00:00|        212.079994|213.30999599999998|        207.210003|        208.069996|152038600|         26.957455|
|2010-01-22 00:00:00|206.78000600000001|        207.499996|            197.16|            197.75|220441900|         25.620401|
|2010-01-25 00:00:00|202.51000200000001|        204.699999|        200.190002|        203.070002|266424900|26.309658000000002|
|2010-01-26 00:00:00|205.95000100000001|        213.710005|        202.580004|        205.940001|466777500|         26.681494|
|2010-01-27 00:00:00|        206.849995|            210.58|        199.530001|        207.880005|430642100|26.932840000000002|
|2010-01-28 00:00:00|        204.930004|        205.500004|        198.699995|        199.289995|293375600|25.819922000000002|
|2010-01-29 00:00:00|        201.079996|        202.199995|        190.250002|        192.060003|311488100|         24.883208|
|2010-02-01 00:00:00|192.36999699999998|             196.0|191.29999899999999|        194.729998|187469100|         25.229131|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
only showing top 20 rows

In [82]:
df.filter("Close < 500").toPandas()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2010-01-04,213.429998,214.499996,212.380001,214.009998,123432400,27.727039
1,2010-01-05,214.599998,215.589994,213.249994,214.379993,150476200,27.774976
2,2010-01-06,214.379993,215.230000,210.750004,210.969995,138040000,27.333178
3,2010-01-07,211.750000,212.000006,209.050005,210.580000,119282800,27.282650
4,2010-01-08,210.299994,212.000006,209.060005,211.980005,111902700,27.464034
...,...,...,...,...,...,...,...
1354,2016-12-23,115.589996,116.519997,115.589996,116.519997,14249500,116.016995
1355,2016-12-27,116.519997,117.800003,116.489998,117.260002,18296900,116.753806
1356,2016-12-28,117.519997,118.019997,116.199997,116.760002,20905900,116.255965
1357,2016-12-29,116.449997,117.110001,116.400002,116.730003,15039500,116.226096
1358,2016-12-30,116.650002,117.199997,115.430000,115.820000,30586300,115.320020

In [86]:
df.filter("Close < 500").select(['Open','Close']).toPandas()
#df.filter("Close < 500").select(['Open','Close']).show()

            Open       Close
0     213.429998  214.009998
1     214.599998  214.379993
2     214.379993  210.969995
3     211.750000  210.580000
4     210.299994  211.980005
...          ...         ...
1354  115.589996  116.519997
1355  116.519997  117.260002
1356  117.519997  116.760002
1357  116.449997  116.730003
1358  116.650002  115.820000

[1359 rows x 2 columns]

In [89]:
df.filter(df['Close'] < 500).select('Volume').toPandas()
#df.filter(df['Close'] < 500).select('Volume').show()

         Volume
0     123432400
1     150476200
2     138040000
3     119282800
4     111902700
...         ...
1354   14249500
1355   18296900
1356   20905900
1357   15039500
1358   30586300

[1359 rows x 1 columns]

In [92]:
df.filter( (df['Close'] < 200) & (df['Open']>200) ).show()

# & = and

+-------------------+------------------+----------+----------+----------+---------+------------------+
|               Date|              Open|      High|       Low|     Close|   Volume|         Adj Close|
+-------------------+------------------+----------+----------+----------+---------+------------------+
|2010-01-22 00:00:00|206.78000600000001|207.499996|    197.16|    197.75|220441900|         25.620401|
|2010-01-28 00:00:00|        204.930004|205.500004|198.699995|199.289995|293375600|25.819922000000002|
|2010-01-29 00:00:00|        201.079996|202.199995|190.250002|192.060003|311488100|         24.883208|
+-------------------+------------------+----------+----------+----------+---------+------------------+

In [93]:
df.filter( (df['Close'] < 200) & ~(df['Open']>200) ).show()

+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|               Date|              Open|              High|               Low|             Close|   Volume|         Adj Close|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
|2010-02-01 00:00:00|192.36999699999998|             196.0|191.29999899999999|        194.729998|187469100|         25.229131|
|2010-02-02 00:00:00|        195.909998|        196.319994|193.37999299999998|        195.859997|174585600|25.375532999999997|
|2010-02-03 00:00:00|        195.169994|        200.200003|        194.420004|        199.229994|153832000|25.812148999999998|
|2010-02-04 00:00:00|        196.730003|        198.370001|        191.570005|        192.050003|189413000|         24.881912|
|2010-02-05 00:00:00|192.63000300000002|             196.0|        190.850002|        195.460001|212576700|25.323710000000002|
|2010-02-08 00:00:00|        195.690006|197.88000300000002|        193.999994|194.11999699999998|119567700|           25.1501|
|2010-02-09 00:00:00|        196.419996|        197.499994|        194.749998|196.19000400000002|158221700|         25.418289|
|2010-02-10 00:00:00|        195.889997|             196.6|            194.26|195.12000700000002| 92590400|          25.27966|
|2010-02-11 00:00:00|        194.880001|        199.750006|194.05999599999998|        198.669994|137586400|         25.739595|
|2010-02-23 00:00:00|        199.999998|        201.330002|        195.709993|        197.059998|143773700|         25.531005|
|2014-06-09 00:00:00|         92.699997|         93.879997|             91.75|         93.699997| 75415000|         88.906324|
|2014-06-10 00:00:00|         94.730003|         95.050003|             93.57|             94.25| 62777000|         89.428189|
|2014-06-11 00:00:00|         94.129997|         94.760002|         93.470001|         93.860001| 45681000|         89.058142|
|2014-06-12 00:00:00|         94.040001|         94.120003|         91.900002|         92.290001| 54749000|         87.568463|
|2014-06-13 00:00:00|         92.199997|         92.440002|         90.879997|         91.279999| 54525000|         86.610132|
|2014-06-16 00:00:00|         91.510002|             92.75|         91.449997|         92.199997| 35561000|         87.483064|
|2014-06-17 00:00:00|         92.309998|         92.699997|         91.800003| 92.08000200000001| 29726000| 87.36920699999999|
|2014-06-18 00:00:00|         92.269997|         92.290001|         91.349998|             92.18| 33514000|          87.46409|
|2014-06-19 00:00:00|         92.290001|         92.300003|         91.339996|         91.860001| 35528000|         87.160461|
|2014-06-20 00:00:00|         91.849998|         92.550003|         90.900002|         90.910004|100898000|         86.259066|
+-------------------+------------------+------------------+------------------+------------------+---------+------------------+
only showing top 20 rows

In [91]:
df.filter( (df['Close'] < 200) & (df['Open']>200) ).toPandas()

,Date,Open,High,Low,Close,Volume,Adj Close
0,2010-01-22,206.780006,207.499996,197.160000,197.750000,220441900,25.620401
1,2010-01-28,204.930004,205.500004,198.699995,199.289995,293375600,25.819922
2,2010-01-29,201.079996,202.199995,190.250002,192.060003,311488100,24.883208

In [95]:
df.filter(df['Low'] == 197.16).toPandas()
# df.filter(df['Low'] == 197.16).show()

        Date        Open        High     Low   Close     Volume  Adj Close
0 2010-01-22  206.780006  207.499996  197.16  197.75  220441900  25.620401

In [96]:
df.filter(df['Low'] == 197.16).collect()

[Row(Date=datetime.datetime(2010, 1, 21, 23, 0), Open=206.78000600000001, High=207.499996, Low=197.16, Close=197.75, Volume=220441900, Adj Close=25.620401)]

In [97]:
result = df.filter(df['Low'] == 197.16).collect()

In [98]:
result[0]

Row(Date=datetime.datetime(2010, 1, 21, 23, 0), Open=206.78000600000001, High=207.499996, Low=197.16, Close=197.75, Volume=220441900, Adj Close=25.620401)

In [100]:
row = result[0]

In [101]:
row.asDict()

{'Adj Close': 25.620401,
 'Close': 197.75,
 'Date': datetime.datetime(2010, 1, 21, 23, 0),
 'High': 207.499996,
 'Low': 197.16,
 'Open': 206.78000600000001,
 'Volume': 220441900}

In [102]:
row.asDict()['Volume']

220441900